Revit 2027 API
StructuralSettings.BoundaryConditionFamilySymbolUserDefined Property
 The id of the FamilySymbol to represent a user-defined boundary condition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId BoundaryConditionFamilySymbolUserDefined { get; set; }
Public Property BoundaryConditionFamilySymbolUserDefined As ElementId
	Get
	Set
public:
property ElementId^ BoundaryConditionFamilySymbolUserDefined {
	ElementId^ get ();
	void set (ElementId^ value);
}
member BoundaryConditionFamilySymbolUserDefined : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace